Se agregan diagramas v1
